import numpy as np
import pandas as pd

unitsmap = {'检验_(WBC)白细胞_单位_全部': (['10～9/L', 'G/L'], [1, 1]), 
        '检验_(PLT)血小板_单位_全部': (['10～9/L', 'G/L'], [1, 1]),
        '检验_(RBC)红细胞计数_单位_全部': (['10～12/L', 'T/L'], [1, 1]),
        '检验_(MCHC)平均红细胞Hb浓度_单位_全部': (['g/L'], [1]),
        '检验_(HB)血红蛋白_单位_全部': (['g/dl', 'g/l'], [1, 10]),
        '检验_(LYMBFB)淋巴细胞百分比_单位_全部': (['%'], [1]),
        '检验_(MONBFB)单核细胞百分比_单位_全部': (['%'], [1]),
        '检验_(LYM)淋巴细胞数_单位_全部': (['10～9/L', 'G/L'], [1, 1]),
        '检验_(NE)中性粒细胞数_单位_全部': (['10～9/L', 'G/L'], [1, 1]),
        '检验_(MON)单核细胞数_单位_全部': (['10～9/L', 'G/L'], [1, 1]),
        '检验_(HCT)*红细胞压积_单位_全部': (['%', 'L/L'], [100, 1]),
        '检验_(MCV)*红细胞平均体积_单位_全部': (['fL'], [1]),
        '检验_(RDWSD)红细胞分布宽度-SD值_单位_全部': (['fl'], [1]),
        '检验_(RDWCV)红细胞分布宽度-CV值_单位_全部': (['%'], [1]),
        '检验_(MPV)平均血小板体积_单位_全部': (['fL'], [1]),
        '检验_(EOSBFB)嗜酸细胞百分比_单位_全部': (['%'], [1]),
        '检验_(BAS)嗜碱细胞数_单位_全部': (['10～9/L', 'G/L'], [1, 1]),
        '检验_(PLCR)大血小板比率_单位_全部': (['%'], [1]),
        '检验_(RDW)红细胞分布宽度_单位_全部': (['%'], [1]),
        }

df = pd.read_table('./pickedrows.txt', dtype = str)

